package com.holovenko.springpatterns.entity.frontline;

import lombok.Getter;

@Getter
public class СитуаціяНаСхідномуФронті extends СитуаціяНаФронті {

    private final СхіднеМісто містоВКотлі;

    public СитуаціяНаСхідномуФронті(Integer відстаньДоНайближчогоХімарса,
                                    ТягаДоКуріння тягаМоскалівДоКуріння,
                                    Boolean чиПрисутніВійськаНато,
                                    НастрійПаровознюка настрійПаровознюка,
                                    СхіднеМісто містоВКотлі) {
        super(відстаньДоНайближчогоХімарса, тягаМоскалівДоКуріння, чиПрисутніВійськаНато, настрійПаровознюка);
        this.містоВКотлі = містоВКотлі;
    }

    @Override
    public Напрямок напрямок() {
        return Напрямок.СХІД;
    }
}
