package com.holovenko.springpatterns.entity.frontline;

import lombok.Getter;

@Getter
public class СитуаціяНаПівденномуФронті extends СитуаціяНаФронті {

    private final РиторикаПропагандистів риторикаПропагандистів;

    public СитуаціяНаПівденномуФронті(Integer відстаньДоНайближчогоХімарса,
                                      ТягаДоКуріння тягаМоскалівДоКуріння,
                                      Boolean чиПрисутніВійськаНато,
                                      НастрійПаровознюка настрійПаровознюка,
                                      РиторикаПропагандистів риторикаПропагандистів) {
        super(відстаньДоНайближчогоХімарса, тягаМоскалівДоКуріння, чиПрисутніВійськаНато, настрійПаровознюка);
        this.риторикаПропагандистів = риторикаПропагандистів;
    }

    @Override
    public Напрямок напрямок() {
        return Напрямок.ПІВДЕНЬ;
    }
}
