package com.holovenko.springpatterns.entity.frontline;

import lombok.Getter;

@Getter
public class СитуаціяНаПівнічномуФронті extends СитуаціяНаФронті {

    private final ПораРоку пораРоку;

    public СитуаціяНаПівнічномуФронті(Integer відстаньДоНайближчогоХімарса,
                                      ТягаДоКуріння тягаМоскалівДоКуріння,
                                      Boolean чиПрисутніВійськаНато,
                                      НастрійПаровознюка настрійПаровознюка,
                                      ПораРоку пораРоку) {
        super(відстаньДоНайближчогоХімарса, тягаМоскалівДоКуріння, чиПрисутніВійськаНато, настрійПаровознюка);
        this.пораРоку = пораРоку;
    }

    @Override
    public Напрямок напрямок() {
        return Напрямок.ПІВНІЧ;
    }
}
